# 1. В новой папке проекта с именем package_exercises/ создайте пакет helpers,
# состоящий из трех модулей: _init_.py, string.py и math.py.
# Добавьте в мoдyльstring.py функцию с именем shout( ), которая получает
# один строковый параметр и возвращает новую строку с символами, пре­
# образованными к верхнему регистру.
# Добавьте в модуль math.py функцию с именем area(), которая получает
# два параметра, length и width, и возвращает их произведение length * width.
# 2. В корневой папке проекта создайте модуль main.py, который импортирует
# функции shout() и area(). Используйте shout() и area() для вывода
# следующего результата:
# AREA OF А 5-ВУ-8 RECTANGLE IS 40
