# 1. Создайте моду ль greeter.py, содержащий единственную функцию greet ().
# Функция должна получать один строковый параметр name и выводить
# в интерактивном окне текст Hello {пате}!, где {пате} заменяется аргу­
# ментом функции.
# 2. Создайте моду ль mаiп.ру, который импортирует функцию greet () из
# greeter.py и вызывает функцию с аргументом "Real Python"


def greet(name):
    print(f'Hello {name}!')
